rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."Director" = 'George Lucas'
---
  def same_director
    @movie = Movie.find(params[:id])
    director = @movie.director
    if ! director || director.empty?
      flash[:notice] = "'#{@movie.title}' has no director info"
      redirect_to movies_path
    else
      @movies = Movie.where(director: director)